"use server"
import React from 'react';

const AboutPage = () => {
  return (
      <main className="max-w-4xl 3xl:max-w-7xl mx-auto px-4 3xl:px-20 py-10 3xl:py-24">
        <h1 className="text-3xl 3xl:text-6xl font-bold mb-6 3xl:mb-12">
          Про цей проєкт
        </h1>

        <p className="text-lg 3xl:text-5xl mb-4 3xl:mb-16">
          Цей вебзастосунок був розроблений у межах дипломного проєкту з метою спрощення внутрішньої координації між викладачами. Він пропонує централізовану платформу для обміну оновленнями, відстеження важливих подій та ефективнішого управління щоденними завданнями.
        </p>

        <p className="text-lg 3xl:text-5xl mb-4 3xl:mb-16">
          Система створена з урахуванням зручності та співпраці й дозволяє викладачам:
        </p>

        <ul className="list-disc list-inside mb-4 3xl:mb-8 text-lg 3xl:text-5xl space-y-2 3xl:space-y-10">
          <li>Публікувати та поширювати події</li>
          <li>Відстежувати та змінювати статус присутності</li>
          <li>Керувати особистою та груповою інформацією</li>
          <li>Отримувати доступ до персоналізованих панелей керування</li>
        </ul>

        <p className="text-lg 3xl:text-5xl mb-4 3xl:mb-8">
          Чи то планування засідання кафедри, оновлення інформації про відвідуваність, чи організація навчальних заходів — цей застосунок покликаний оптимізувати комунікацію та зменшити адміністративне навантаження.
        </p>

        <p className="text-lg 3xl:text-5xl">
          Проєкт створено з використанням сучасних вебтехнологій, зокрема <strong>Next.js</strong>, <strong>TypeScript</strong> та модульної архітектури для забезпечення масштабованості та зручності супроводу.
        </p>
      </main>
  );
};

export default AboutPage;
