"use server"
import React from 'react';

const PrivacyPolicyPage = () => {
  return (
      <main className="max-w-4xl 3xl:max-w-7xl mx-auto px-4 3xl:px-20 py-10 3xl:py-24">
        <h1 className="text-3xl 3xl:text-6xl font-bold mb-6 3xl:mb-12">Політика конфіденційності</h1>

        <p className="text-lg 3xl:text-4xl mb-4 3xl:mb-8">
          Цей застосунок було створено в межах дипломного проєкту та призначено для освітніх і демонстраційних цілей.
        </p>

        <p className="text-lg 3xl:text-4xl mb-4 3xl:mb-8">
          Ми поважаємо вашу конфіденційність. Уся особиста інформація, якою ви ділитеся у застосунку (наприклад, ім’я, статус або дані активності), використовується виключно для реалізації функцій на кшталт обміну подіями чи оновлень статусу між викладачами.
        </p>

        <p className="text-lg 3xl:text-4xl mb-4 3xl:mb-8">
          Дані не передаються третім особам, і ми не використовуємо вашу інформацію для реклами чи відстеження.
        </p>

        <p className="text-lg 3xl:text-4xl mb-4 3xl:mb-8">
          Хоч ми й прагнемо забезпечити безпеку даних, просимо врахувати, що це студентський проєкт, а не промисловий продукт. Використання застосунку слід обмежити тестуванням або внутрішніми академічними потребами.
        </p>

        <p className="text-lg 3xl:text-4xl">
          Якщо у вас виникнуть питання щодо конфіденційності або обробки даних — звертайтеся до розробника.
        </p>
      </main>
  );
};

export default PrivacyPolicyPage;
